#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-VsrJfahTUM1jbrwX

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.allow_egress: Refreshing state... [id=sg-01bbbcc6e5692161b]
aws_security_group.allow_icmp: Refreshing state... [id=sg-08e7ed5aa3caa810e]
aws_security_group.allow_ssh: Refreshing state... [id=sg-006ce6110566350f2]
aws_security_group.allow_cockpit: Refreshing state... [id=sg-09158a308f058582a]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20201204204656723700000009]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20201204204656609900000007]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20201204204656576600000006]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_launch_template.worker_x86: Refreshing state... [id=lt-02c4ef76cd0a29529]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_spot_fleet_request.imagebuilder_worker_x86: Refreshing state... [id=sfr-28456c4c-dc0f-496d-a24c-e13e881d94ba]
aws_instance.composer_internal: Refreshing state... [id=i-0035f4672fb80495c]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-2882311107]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0aae9d85fdd3f7067]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-c71def07-6497-4a21-9ece-506106aa6387]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.worker_internal_user_data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "worker_internal_user_data"  {
      ~ id       = "bcbabb42679bcee105f58c381d22854768a6eb8cc49790b10c7c87cfdea2baf0" -> (known after apply)
      ~ rendered = <<-EOT
            #!/bin/bash
            set -euxo pipefail
            
            # Variables from Terraform go here.
            OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
            COMPOSER_COMMIT=2dff7d05298349ef59adf94a4de7a3dd289c06d3
            COMPOESR_HOST=aws.composer.osbuild.org
            COMPOSER_ADDRESS=10.30.18.11
            OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
            WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
            
            # Forward systemd journal to the console for easier viewing.
            # This is done at the beginning of this script so we log all errors.
            mkdir -p /etc/systemd/journald.conf.d/
            tee /etc/systemd/journald.conf.d/forward-to-console.conf > /dev/null << EOF
            [Journal]
            ForwardToConsole=yes
            MaxLevelConsole=6
            EOF
            
            # Ensure the SELinux contexts are correct.
            restorecon -Rv /etc/systemd
            
            # Restart journald to pick up the console log change.
            systemctl restart systemd-journald
            
            # Variables for the script.
            COMPOSER_DIR=/etc/osbuild-composer
            
            # Set up /etc/hosts
            # TODO(mhayden): We need to convert this to DNS later when we launch.
            cat <<< "${COMPOSER_ADDRESS} ${COMPOESR_HOST}" >> /etc/hosts
            
            # Deploy the composer CA certificate.
            mkdir ${COMPOSER_DIR}
            base64 -d - <<< ${OSBUILD_CA_CERT} > ${COMPOSER_DIR}/ca-crt.pem
            
            # Deploy the composer key and certificate.
            /usr/local/bin/aws secretsmanager get-secret-value \
              --secret-id ${WORKER_SSL_KEYS_ARN} | jq -r ".SecretString" > /tmp/worker_keys.json
            jq -r ".worker_key" /tmp/worker_keys.json | base64 -d - > ${COMPOSER_DIR}/worker-key.pem
            jq -r ".worker_crt" /tmp/worker_keys.json | base64 -d - > ${COMPOSER_DIR}/worker-crt.pem
            rm -f /tmp/worker_keys.json
            
            # Prepare osbuild-composer's remote worker services and sockets.
            systemctl enable --now osbuild-remote-worker@${COMPOESR_HOST}:8700
            
        EOT -> (known after apply)
      ~ template = <<-EOT
            #!/bin/bash
            set -euxo pipefail
            
            # Variables from Terraform go here.
            OSBUILD_COMMIT=${osbuild_commit}
            COMPOSER_COMMIT=${composer_commit}
          - COMPOESR_HOST=${composer_host}
          + COMPOSER_HOST=${composer_host}
            COMPOSER_ADDRESS=${composer_address}
            OSBUILD_CA_CERT=${osbuild_ca_cert}
            WORKER_SSL_KEYS_ARN=${worker_ssl_keys_arn}
            
            ${setup_script}
        EOT
      ~ vars     = {
          ~ "composer_address"    = "10.30.18.11" -> (known after apply)
          ~ "composer_commit"     = "2dff7d05298349ef59adf94a4de7a3dd289c06d3" -> "9b2d565545752338741b3e2aeaf87367e23a82d4"
          ~ "setup_script"        = <<-EOT
              - # Forward systemd journal to the console for easier viewing.
              - # This is done at the beginning of this script so we log all errors.
              - mkdir -p /etc/systemd/journald.conf.d/
              - tee /etc/systemd/journald.conf.d/forward-to-console.conf > /dev/null << EOF
              - [Journal]
              - ForwardToConsole=yes
              - MaxLevelConsole=6
              - EOF
              - 
              - # Ensure the SELinux contexts are correct.
              - restorecon -Rv /etc/systemd
              - 
              - # Restart journald to pick up the console log change.
              - systemctl restart systemd-journald
              - 
                # Variables for the script.
                COMPOSER_DIR=/etc/osbuild-composer
                
                # Set up /etc/hosts
                # TODO(mhayden): We need to convert this to DNS later when we launch.
              - cat <<< "${COMPOSER_ADDRESS} ${COMPOESR_HOST}" >> /etc/hosts
              + cat <<< "${COMPOSER_ADDRESS} ${COMPOSER_HOST}" >> /etc/hosts
                
                # Deploy the composer CA certificate.
                mkdir ${COMPOSER_DIR}
                base64 -d - <<< ${OSBUILD_CA_CERT} > ${COMPOSER_DIR}/ca-crt.pem
                
                # Deploy the composer key and certificate.
                /usr/local/bin/aws secretsmanager get-secret-value \
                  --secret-id ${WORKER_SSL_KEYS_ARN} | jq -r ".SecretString" > /tmp/worker_keys.json
                jq -r ".worker_key" /tmp/worker_keys.json | base64 -d - > ${COMPOSER_DIR}/worker-key.pem
                jq -r ".worker_crt" /tmp/worker_keys.json | base64 -d - > ${COMPOSER_DIR}/worker-crt.pem
                rm -f /tmp/worker_keys.json
                
                # Prepare osbuild-composer's remote worker services and sockets.
              - systemctl enable --now osbuild-remote-worker@${COMPOESR_HOST}:8700
              + systemctl enable --now osbuild-remote-worker@${COMPOSER_HOST}:8700
            EOT
            # (4 unchanged elements hidden)
        }
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ ami                          = "ami-06ba06f30c04628ce" -> "ami-0e509a017007c92e2" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-0035f4672fb80495c" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0035f4672fb80495c" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data                    = "1f9d87622c5213c8e667cfdbcf0df81290466fa5" -> "74ecfa62466248b9e0e90562c216c1ae8ee49091" # forces replacement
      ~ volume_tags                  = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "🏗 Internal Composer (staging)"
          - "ServiceOwner" = "Image Builder"
        } -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ volume_id             = "vol-0acf7947dd408b002" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 3 -> (known after apply)
        id                      = "lt-0aae9d85fdd3f7067"
      ~ image_id                = "ami-06ba06f30c04628ce" -> "ami-0e509a017007c92e2"
      ~ latest_version          = 3 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD0yZGZmN2QwNTI5ODM0OWVmNTlhZGY5NGE0ZGU3YTNkZDI4OWMwNmQzCkNPTVBPRVNSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTAuMzAuMTguMTEKT1NCVUlMRF9DQV9DRVJUPUxTMHRMUzFDUlVkSlRpQkRSVkpVU1VaSlEwRlVSUzB0TFMwdENrMUpTVVJFVkVORFFXWlhaMEYzU1VKQlowbFZVRE5RTTJZek5WQkdVazUxYjJaMGVtTTVURGsyUkdoVWIyUkJkMFJSV1VwTGIxcEphSFpqVGtGUlJVd0tRbEZCZDBacVJWVk5Ra2xIUVRGVlJVRjNkMHhpTTA1cFpGZHNjMXBETlhaamJXTjNTR2hqVGsxcVFYZFBWRVY2VFZSWmVVMUVWVE5YYUdOT1RYcEJkd3BQVkVWNFRWUlplVTFFVlROWGFrRlhUVkpSZDBWbldVUldVVkZFUkVGMGRtTXlTakZoVjNoclRHMDVlVnA2UTBOQlUwbDNSRkZaU2t0dldrbG9kbU5PQ2tGUlJVSkNVVUZFWjJkRlVFRkVRME5CVVc5RFoyZEZRa0ZOUW5CcldWRllTVk5NWXpoTFdXcE5VVmxuZW5CUk9VTkJNMUpMTW1kSVJEQnhZWEZ6ZGpnS1lWSmpWa00yTmxNNVpraHhSVVV4YVV4VldFODNNREpSZWpWemEycG9NM3B4VEhsSFVqaDNVbFl2TDJOSk1XSXhjakJWZVZwVFkweGFNMWMzVlZweVF3bzBORFJtWTNvelRYbDRiRk42VjFWWlUxQm5Ra2xMYUdkQk9IRnRjbHBTTVc5bVlXUnllSFZTVEN0emJrWkVTV3Q0TTNjcll6RktaVlZ1TW1Oc01GZHBDbFYwV0RKSFIxWkRSbGROVDJGdlprUnJXRlZEUm5WTFNIZEtVV2RHVEhSelNFTmFXV05tZGxkV1NGcGFOazQ0ZDBkd01sRmFXVEk1WXpoMWJYQnFNVkFLVUVac1dFTTRaR0ZhVEUxaFdGbGlSVEJOU1hSV01FTklTbkIzUjBsd1lubHViVmxVYkN0elJuVjJiRFJ2VkcxeWVIb3ZlWGg2Y0VSMlZrMVBja0ZKYlFwNGIyczNjbFZ0VkhWa1JHVkZVMUpDVDJkQk1VdDFZVTFTVkhWaFNYQlJiekprYjNaeEt6QXhSbVl6UVU0eVZVTkJkMFZCUVdGT1ZFMUdSWGRJVVZsRUNsWlNNRTlDUWxsRlJrbzNaVFpZTTNrd1pHOXNjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUNPRWRCTVZWa1NYZFJXVTFDWVVGR1NqZGxObGd6ZVRCa2Iyd0tjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUJPRWRCTVZWa1JYZEZRaTkzVVVaTlFVMUNRV1k0ZDBSUldVcExiMXBKYUhaalRrRlJSVXhDVVVGRVoyZEZRZ3BCUm5wMk4ybGxTMGM1YkZwTGNrSXlUVzFhYUVGeFNFbE1lV3hoVDNsV2NUYzNSemxDVFZKVVJuTndXblUwTUhJM1IxUjNZMFJvZG1nMVJVTnZTRkZpQ214cmRUQllOVTlZWjBSMldITkNjRzlHU0hKMk1FdFBTV3hUTjFWS01YWXdOR3N2U2xsbldIY3JiR3BVVkhNdk9YcHdiamhTVm14dGNIVXZSMDFQVFRVS1VXSkhVQ3RPYWpWYWN6Vm1SMFpYYUU0M1RUSTFVV3RWT0RKS2JIaGxTa0ZzVVhoSVEyeERVR1Y0VWtOTllURjVOWEEzVkc1bk9EQkxTbGQwZVZCUU9RcDBVMmROUW5BM05WVlNaVzgwTlVVNFVFcHlTbkF6YUhsdk5GSjRPVkpSUjJ0eWVXTlNTWGRtUWtoMmEzaE5TbVp1YzJNM1dTOTJOV2wxUmpodGVFMTZDak4wWWtvNUswcDVSVUYxU0hveFlrZDFjVU5ZSzNGS1VWUlVkQzlSYnpZeWRrZFhZVWs1VTFaTFlsTTRZVmhNUXpKT05uRmphV0p4Y2pVNFpqUkVTa1FLU25Oc1RTODNjSE41Y2pGdk5YUjBZa0p1TmxrMVFYTTlDaTB0TFMwdFJVNUVJRU5GVWxSSlJrbERRVlJGTFMwdExTMEsKV09SS0VSX1NTTF9LRVlTX0FSTj1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLWVhc3QtMTo5MzM3NTIxOTc5OTk6c2VjcmV0OmJyZXdfa2V5cy03RlVlZWwKCiMgRm9yd2FyZCBzeXN0ZW1kIGpvdXJuYWwgdG8gdGhlIGNvbnNvbGUgZm9yIGVhc2llciB2aWV3aW5nLgojIFRoaXMgaXMgZG9uZSBhdCB0aGUgYmVnaW5uaW5nIG9mIHRoaXMgc2NyaXB0IHNvIHdlIGxvZyBhbGwgZXJyb3JzLgpta2RpciAtcCAvZXRjL3N5c3RlbWQvam91cm5hbGQuY29uZi5kLwp0ZWUgL2V0Yy9zeXN0ZW1kL2pvdXJuYWxkLmNvbmYuZC9mb3J3YXJkLXRvLWNvbnNvbGUuY29uZiA+IC9kZXYvbnVsbCA8PCBFT0YKW0pvdXJuYWxdCkZvcndhcmRUb0NvbnNvbGU9eWVzCk1heExldmVsQ29uc29sZT02CkVPRgoKIyBFbnN1cmUgdGhlIFNFTGludXggY29udGV4dHMgYXJlIGNvcnJlY3QuCnJlc3RvcmVjb24gLVJ2IC9ldGMvc3lzdGVtZAoKIyBSZXN0YXJ0IGpvdXJuYWxkIHRvIHBpY2sgdXAgdGhlIGNvbnNvbGUgbG9nIGNoYW5nZS4Kc3lzdGVtY3RsIHJlc3RhcnQgc3lzdGVtZC1qb3VybmFsZAoKIyBWYXJpYWJsZXMgZm9yIHRoZSBzY3JpcHQuCkNPTVBPU0VSX0RJUj0vZXRjL29zYnVpbGQtY29tcG9zZXIKCiMgU2V0IHVwIC9ldGMvaG9zdHMKIyBUT0RPKG1oYXlkZW4pOiBXZSBuZWVkIHRvIGNvbnZlcnQgdGhpcyB0byBETlMgbGF0ZXIgd2hlbiB3ZSBsYXVuY2guCmNhdCA8PDwgIiR7Q09NUE9TRVJfQUREUkVTU30gJHtDT01QT0VTUl9IT1NUfSIgPj4gL2V0Yy9ob3N0cwoKIyBEZXBsb3kgdGhlIGNvbXBvc2VyIENBIGNlcnRpZmljYXRlLgpta2RpciAke0NPTVBPU0VSX0RJUn0KYmFzZTY0IC1kIC0gPDw8ICR7T1NCVUlMRF9DQV9DRVJUfSA+ICR7Q09NUE9TRVJfRElSfS9jYS1jcnQucGVtCgojIERlcGxveSB0aGUgY29tcG9zZXIga2V5IGFuZCBjZXJ0aWZpY2F0ZS4KL3Vzci9sb2NhbC9iaW4vYXdzIHNlY3JldHNtYW5hZ2VyIGdldC1zZWNyZXQtdmFsdWUgXAogIC0tc2VjcmV0LWlkICR7V09SS0VSX1NTTF9LRVlTX0FSTn0gfCBqcSAtciAiLlNlY3JldFN0cmluZyIgPiAvdG1wL3dvcmtlcl9rZXlzLmpzb24KanEgLXIgIi53b3JrZXJfa2V5IiAvdG1wL3dvcmtlcl9rZXlzLmpzb24gfCBiYXNlNjQgLWQgLSA+ICR7Q09NUE9TRVJfRElSfS93b3JrZXIta2V5LnBlbQpqcSAtciAiLndvcmtlcl9jcnQiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1jcnQucGVtCnJtIC1mIC90bXAvd29ya2VyX2tleXMuanNvbgoKIyBQcmVwYXJlIG9zYnVpbGQtY29tcG9zZXIncyByZW1vdGUgd29ya2VyIHNlcnZpY2VzIGFuZCBzb2NrZXRzLgpzeXN0ZW1jdGwgZW5hYmxlIC0tbm93IG9zYnVpbGQtcmVtb3RlLXdvcmtlckAke0NPTVBPRVNSX0hPU1R9Ojg3MDAKCg==" -> (known after apply)
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20201207162526937700000002" -> (known after apply)
      ~ id                                  = "sfr-c71def07-6497-4a21-9ece-506106aa6387" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0aae9d85fdd3f7067" -> null
              - version = "3" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0aae9d85fdd3f7067"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-2882311107" -> (known after apply)
      ~ instance_id = "i-0035f4672fb80495c" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  ~ rhel8_x86_prebuilt = "RHEL 8 pre-built: imagebuilder-service-image-20201203155459 (ami-06ba06f30c04628ce)" -> "RHEL 8 pre-built: imagebuilder-service-image-20201210151424 (ami-0e509a017007c92e2)"
```

</details>

*Pusher: @major, Action: `pull_request`*